[
    {   
        "id": "meridius",
        "image": "meridius.png",
        "to": "/meridius",
        "description": "Бесплатный и современный музыкальный плеер для социальной сети ВКонтакте. Самый большой личный проект. Пиковый показатель пользователей - 86 человек, в среднем приложением пользуются 25~ человек ежедневно. Проект проприетарный и не преследует коммерческих целей. Meridius предлагает функционал, не только функционал, соответствующий функционалу самой социальной сети ВКонтакте, но так же предлагает уникальный, вроде эквалайзера, нормализации громкости, горячих клавиш, веб-сервера, цветовых схем, импорт музыки из YouTube и так далее.\n\nОперационная система: Windows 7 и выше, Linux\nТехнологии: Electron, Nuxt/Vue 2, SCSS, Google Analytics"
    },
    {
        "id": "Stream Overlay",
        "image": "overlay.png",
        "to": "https://github.com/PurpleHorrorRus/StreamOverlay",
        "description": "Приложение для ведущих прямых трансляций с одним монитором. Поддерживает полную интеграцию с площадками Twitch и Trovo. Приложение выводится поверх всех окон, имеет низкое потребление ресурсов компьютера, поддерживает вывод чата, возможность редактировать виджеты прямых трансляций, редактирование информации о трансляции, а также настройку аккаунта и управление рекламой на канале.\n\nОперационная система: Windows 7 и выше\nТехнологии: Electron, Nuxt/Vue 2, SCSS"
    },
    {
        "id": "EasyVK AudioAPI",
        "image": "package.png",
        "to": "https://github.com/PurpleHorrorRus/EasyVK-AudioAPI",
        "description": "EasyVK AudioAPI - Библиотека с открытым исходным кодом, реализующая неофициальный Audio API социальной сети ВКонтакте. Используется в качестве ядра в Meridius. Поддерживает авторизацию с помощью логина, пароля и двухэтапной аутентификации, работает с cookies и запросами на сервера социальной сети, имитируя браузер.\n\nТехнологии: Node.js, Jest\nПаттерны: Single responsibility, Dependency inversion"
    },
    {
        "id": "simple-helix-api",
        "image": "package.png",
        "to": "https://github.com/PurpleHorrorRus/simple-helix-api",
        "description": "simple-helix-api - Библиотека с открытым исходным кодом, необходимая для простой инициализации и работы с API стриминговой платформы Twitch. Имеет более 200 скачиваний на npm.\n\nТехнологии: Node.js, Jest\nПаттерны: Single responsibility, Dependency inversion"
    }
]