<template>
    <Category id="index-page-about" :label="'О себе'">
        <div id="index-page-about-text" class="category-text">
            <p>
                Привет, мир! Меня зовут Никифоров Максим Игоревич и Я занимаюсь
                созданием веб-сайтов и настольных приложений, используя
                современные технологии. Работаю Frontend-разработчиком на Nuxt и
                Vue уже более трёх лет, постоянно совершенствую собственные
                навыки, стремлюсь к новым знаниям. Так же имею и поддерживаю
                собственные проекты, используемые другими пользователями.
            </p>
            <p>
                Начал увлекаться программированием со средней школы и достаточно
                продолжительное время разрабатывал простые приложения и
                небольшие игры на Java. В 2018 году начинал изучать
                HTML/Javascript/CSS и следом jQuery. Набираясь опыта, Я изучил
                NodeJS и Electron, чтобы создавать современные настольные
                приложения, которые могли бы быть полезны конечным
                пользователям, в то время появилась первая версия моего личного
                крупного некоммерческого проекта под названием Meridius -
                музыкального плеера для социальной сети ВКонтакте.
            </p>
            <p>
                Учился в техническом ВУЗе, а именно в Институте Математики,
                Экономики и Информатики Иркутского Государственного
                Университета, в это время, в 2019 году Я начал углубляться во
                Frontend разработку, узнав, что на то время было актуально в
                среде разработки, после этого приступил к изучению VueJS,
                параллельно изучая и другие технологии, как Reactivity, SSR,
                PostCSS. Познакомился и углубился в изучение NuxtJS и сейчас это
                основная моя технология для разработки веб-приложений, статичных
                сайтов и настольных приложений на Electron. Таким образом,
                связав Electron и Nuxt, Я воссоздал этих технологиях Meridius,
                работоспособность которого поддерживаю по сей день. Также Я
                разрабатываю и поддерживаю некоторые собственные библиотеки,
                которые интегрировали в свои проекты более 100 разработчиков.
            </p>
            <p>
                Во времена пандемии и до февраля 2022 года разрабатывал лендинги
                и одностраничные сайты под заказ на аутсорсе. Сейчас нахожусь в
                поисках работы в городе Иркутске. Привит от инфекции COVID-19 и
                имею подлинный сертификат о вакцинации вакциной "Спутник V".
            </p>
            <p>
                Если Вас заинтересовала моя кандидатура, то свяжитесь со мной
                любым удобным способом. Если Вы рассмотрели мою вакансию, то
                позвоните по номеру телефона, указанному в ней.
            </p>
        </div>
    </Category>
</template>

<script>
import Category from "~/components/General/Category";

export default {
    components: {
        Category
    }
};
</script>